tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/services"

cask_args appdir: "/Applications"

# Mac App Store Applications
mas "Bitwarden", id: 1352778147
mas "TestFlight", id: 899247664
mas "Wireguard", id: 1451685025
mas "Xcode", id: 497799835

# System utilities
brew "chezmoi"
brew "FelixKratz/formulae/borders"
brew "mas"
brew "mise"
cask "appcleaner"
cask "font-commit-mono-nerd-font"
cask "linearmouse" # not sure if needed
cask "logi-options+" # not sure if needed
cask "mos" # not sure if needed
cask "nikitabobko/tap/aerospace"
cask "raycast"
cask "stats"

# CLI tools
brew "bat"
brew "ffmpeg"
brew "fzf"
brew "ripgrep"
brew "wget"

# Development tools
brew "git"
cask "bruno"
cask "docker"
cask "orbstack"
# cask "postman"
cask "screaming-frog-seo-spider"
cask "sublime-text"
cask "tableplus"
cask "visual-studio-code"
# cask "yaak"

# Javascript & Node development
brew "pnpm"
brew "yarn"

# Mobile development
brew "cocoapods" # iOS only
brew "watchman" # React Native only
cask "android-studio" # Android only
# brew "fastlane"

# PHP development
brew "dnsmasq"
brew "httpd"
brew "imagemagick"
brew "libyaml"
brew "mariadb"
brew "openssl@3"
brew "php"
brew "php@7.0"
brew "php@7.1"
brew "php@7.2"
brew "php@7.3"
brew "php@7.4"
brew "php@8.0"
brew "php@8.1"
brew "php@8.2"
brew "php@8.3"

# Web browsers
cask "brave-browser"
cask "firefox"
cask "google-chrome"

# Productivity tools
cask "google-drive" # not sure if needed
cask "notion-calendar"
cask "notion"
cask "todoist"

# Communication tools
cask "cameracontroller"
cask "discord"
cask "mattermost" # only for work
cask "microsoft-teams" # only for work

# Media
cask "spotify"
# cask "transmission" # not sure if needed (torrent client)
cask "vlc"








