tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/services"

cask_args appdir: "/Applications"

# Fonts
brew "font-commit-mono-nerd-font"

# System utilities (CLI)
brew "chezmoi"
brew "felixkratz/formulae/borders"

# System utilities (Apps)
cask "appcleaner"
cask "hyperkey"
cask "logi-options+"
cask "mos"
cask "nikitabobko/tap/aerospace"
cask "raycast"
cask "stats"

# CLI tools
brew "bat"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "gnupg"
brew "mise"
brew "ripgrep"
brew "rlwrap"
brew "wget"

# Development tools (Apps)
cask "bruno"
cask "chatgpt"
cask "cursor"
cask "docker"
cask "iterm2"
cask "orbstack"
cask "screaming-frog-seo-spider"
cask "sublime-text"
cask "tableplus"
cask "visual-studio-code" # not used anymore for now
cask "xcodes"

# Javascript & Node development (CLI)
brew "pnpm"
brew "yarn"

# Mobile development (CLI)
brew "cocoapods" # iOS only
brew "watchman" # React Native only
# brew "fastlane"

# Mobile development (Apps)
cask "android-studio" # Android only

# PHP development (CLI)
brew "dnsmasq" # work only
brew "httpd" # work only
brew "imagemagick" # work only
brew "libyaml" # work only
brew "mariadb" # work only
brew "openssl@3" # work only
brew "shivammathur/php/php" # work only
brew "shivammathur/php/php@7.0" # work only
brew "shivammathur/php/php@7.1" # work only
brew "shivammathur/php/php@7.2" # work only
brew "shivammathur/php/php@7.3" # work only
brew "shivammathur/php/php@7.4" # work only
brew "shivammathur/php/php@8.0" # work only
brew "shivammathur/php/php@8.1" # work only
brew "shivammathur/php/php@8.2" # work only
brew "shivammathur/php/php@8.3" # work only

# Web browsers (Apps)
cask "arc"
cask "brave-browser"
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"

# Productivity tools (Apps)
cask "google-drive"
cask "notion"
cask "raindropio"
cask "todoist"

# Communication tools (Apps)
cask "cameracontroller"
cask "discord"
cask "mattermost" # work only
cask "microsoft-teams" # work only

# Media (Apps)
cask "spotify"
cask "iptvnator" # personal only
cask "vlc"
# cask "transmission" # personal only (torrent client)

# Mac App Store Applications
mas "Bitwarden", id: 1352778147
mas "TestFlight", id: 899247664
mas "Wireguard", id: 1451685025 # work only
