# Configuration
cask_args appdir: "/Applications"

# Fonts
cask "font-commit-mono-nerd-font"

# Utilities (Apps)
cask "appcleaner"
cask "imageoptim"
cask "logi-options+"
cask "mos"
cask "nikitabobko/tap/aerospace"
cask "mediosz/tap/swipeaerospace"
cask "raycast"

# Utilities (CLI)
brew "chezmoi"
brew "FelixKratz/formulae/borders"
brew "mas"

# Shell tools (CLI)
brew "bat"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gnupg"
brew "ripgrep"
brew "rlwrap"
brew "wget"

# Zsh plugins
brew "powerlevel10k"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Dev tools (Apps)
cask "bruno"
cask "cursor"
cask "devtoys"
cask "iterm2"
cask "orbstack"
cask "screaming-frog-seo-spider"
cask "sublime-text"
cask "tableplus"
cask "xcodes-app"

# Dev tools (CLI)
brew "git"
brew "mise"

# Mobile development (Apps)
cask "android-studio"

# Mobile development (CLI)
brew "cocoapods"
brew "watchman"
# brew "fastlane"

{{ if .is_work_device }}
# PHP development (CLI)
brew "dnsmasq"
brew "httpd"
brew "imagemagick"
brew "libyaml"
brew "mariadb"
brew "openssl@3"
brew "shivammathur/php/php"
brew "shivammathur/php/php@7.0"
brew "shivammathur/php/php@7.1"
brew "shivammathur/php/php@7.2"
brew "shivammathur/php/php@7.3"
brew "shivammathur/php/php@7.4"
brew "shivammathur/php/php@8.0"
brew "shivammathur/php/php@8.1"
brew "shivammathur/php/php@8.2"
brew "shivammathur/php/php@8.3"
{{ end }}

# Design tools (Apps)
cask "canva"
cask "figma"

# Web browsers (Apps)
cask "brave-browser"
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"

# Productivity tools (Apps)
{{ if eq .chezmoi.arch "arm64" }}
cask "chatgpt"
{{ end }}
cask "google-drive"
cask "notion"
cask "raindropio"
cask "todoist-app"

# Communication tools (Apps)
cask "cameracontroller"
cask "discord"
{{ if .is_work_device }}
cask "mattermost"
cask "microsoft-teams"
{{ end }}

# Media (Apps)
cask "spotify"
cask "vlc"
{{ if .is_personal_device }}
cask "iptvnator"
cask "transmission"
{{ end }}

# Mac App Store Applications
mas "Bitwarden", id: 1352778147
mas "TestFlight", id: 899247664
{{ if .is_work_device }}
mas "Wireguard", id: 1451685025
{{ end }}
